In [2]:
import numpy as np 
import pandas as pd

## WPI value ( inflation )

In [3]:
year2025 = [ 139.9, 139.8, 140.2, 139.8, 138.6, 140, 140.5, 140.4, 140.4, 140.4]

In [28]:
fin_data= pd.read_csv("fin_dataset.csv")

In [29]:
print(fin_data.head())

         Date     Price      Open      High       Low   Vol. Change %
0  02-03-2025  3,355.00  3,402.00  3,420.00  3,350.00  0.24K   -1.06%
1  23-02-2025  3,391.00  3,446.00  3,446.00  3,349.00  1.33K   -1.85%
2  16-02-2025  3,455.00  3,379.00  3,464.00  3,379.00  1.06K    2.83%
3  09-02-2025  3,360.00  3,422.00  3,422.00  3,360.00  0.03K   -1.81%
4  02-02-2025  3,422.00  3,422.00  3,422.00  3,422.00    NaN    0.00%

In [30]:
fin_data.describe()

              Date     Price      Open      High       Low   Vol. Change %
count          473       473       473       473       473    407      473
unique         473       371       358       370       364    253      350
top     29-11-2015  3,517.00  3,550.00  3,517.00  3,517.00  0.01K    0.00%
freq             1         5         5         5         6     21       60

In [31]:
fin_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 473 entries, 0 to 472
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      473 non-null    object
 1   Price     473 non-null    object
 2   Open      473 non-null    object
 3   High      473 non-null    object
 4   Low       473 non-null    object
 5   Vol.      407 non-null    object
 6   Change %  473 non-null    object
dtypes: object(7)
memory usage: 26.0+ KB

In [32]:
## convert object to datetime date is in dd /mm/yyyy format

fin_data['Date'] = pd.to_datetime(fin_data['Date'],dayfirst=True)

In [33]:
## convert object into integer
## replace , with nothing
fin_data['Price'] = fin_data['Price'].str.replace(',', '')
fin_data['Price'] = fin_data['Price'].astype(float)

In [34]:
fin_data["Open"] = fin_data["Open"].str.replace(',', '')
fin_data["Open"] = fin_data["Open"].astype(float)
fin_data["High"] = fin_data["High"].str.replace(',', '') 
fin_data["High"] = fin_data["High"].astype(float)
fin_data["Low"] = fin_data["Low"].str.replace(',', '')
fin_data["Low"] = fin_data["Low"].astype(float)

In [35]:
fin_data.head()

        Date   Price    Open    High     Low   Vol. Change %
0 2025-03-02  3355.0  3402.0  3420.0  3350.0  0.24K   -1.06%
1 2025-02-23  3391.0  3446.0  3446.0  3349.0  1.33K   -1.85%
2 2025-02-16  3455.0  3379.0  3464.0  3379.0  1.06K    2.83%
3 2025-02-09  3360.0  3422.0  3422.0  3360.0  0.03K   -1.81%
4 2025-02-02  3422.0  3422.0  3422.0  3422.0    NaN    0.00%

In [36]:
fin_data.set_index('Date', inplace=True)

In [37]:
fin_data["Change %"]= fin_data["Change %"].str.replace('%','')
fin_data["Change %"] = fin_data["Change %"].astype(float)

In [38]:
fin_data.head()

             Price    Open    High     Low   Vol.  Change %
Date
2025-03-02  3355.0  3402.0  3420.0  3350.0  0.24K     -1.06
2025-02-23  3391.0  3446.0  3446.0  3349.0  1.33K     -1.85
2025-02-16  3455.0  3379.0  3464.0  3379.0  1.06K      2.83
2025-02-09  3360.0  3422.0  3422.0  3360.0  0.03K     -1.81
2025-02-02  3422.0  3422.0  3422.0  3422.0    NaN      0.00

In [39]:
fin_data.columns

Index(['Price', 'Open', 'High', 'Low', 'Vol.', 'Change %'], dtype='object')

In [40]:
fin_data.describe()

             Price         Open         High          Low    Change %
count   473.000000   473.000000   473.000000   473.000000  473.000000
mean   3903.446089  3904.752643  3972.477801  3834.359408    0.184947
std     790.535879   791.642561   815.358032   762.635627    3.480997
min    1848.000000  1809.000000  1848.000000  1765.000000  -13.590000
25%    3528.000000  3530.000000  3598.000000  3500.000000   -1.550000
50%    3871.000000  3880.000000  3938.000000  3830.000000    0.000000
75%    4175.000000  4170.000000  4252.000000  4120.000000    1.710000
max    6324.000000  6200.000000  6733.000000  6002.000000   31.120000

In [41]:
## drop nan values
fin_data.dropna(inplace=True)

In [42]:
fin_data.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 407 entries, 2025-03-02 to 2015-12-13
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Price     407 non-null    float64
 1   Open      407 non-null    float64
 2   High      407 non-null    float64
 3   Low       407 non-null    float64
 4   Vol.      407 non-null    object
 5   Change %  407 non-null    float64
dtypes: float64(5), object(1)
memory usage: 22.3+ KB

In [43]:
sample_li=[]
for i in fin_data['Vol.']:
    sample_li.append("K" in i)

In [44]:
print(sample_li)

[True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True, True]

In [45]:
from collections import Counter
Counter(sample_li)

Counter({True: 407})

In [47]:
fin_data["Vol."] = fin_data["Vol."].str.replace('K','')
fin_data["Vol."] = fin_data["Vol."].astype(float)
## multiply by 1000 to convert to actual number
fin_data["Vol."] = fin_data["Vol."] * 1000

In [48]:
fin_data.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 407 entries, 2025-03-02 to 2015-12-13
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Price     407 non-null    float64
 1   Open      407 non-null    float64
 2   High      407 non-null    float64
 3   Low       407 non-null    float64
 4   Vol.      407 non-null    float64
 5   Change %  407 non-null    float64
dtypes: float64(6)
memory usage: 22.3 KB